Repository: mozilla-l10n/mt-training-data
Catalog: su/su_pontoon.tmx
Source language: en_us
Languages: su

source: You need this password to access any encrypted data you store with us.<br/>A reset means potentially losing data like passwords and bookmarks.
su: Anjeun butuh ieu kecap sandi pikeun muka data diénkrip anu diteundeun di kami.<br/>Rését hartina bisa leungiteun data sarupaning kecap sandi jeung marka buku.

source: Your account has been locked for security reasons
su: Akun anjeun geus dikonci pikeun alesan kaamanan

source: Your account is ready!
su: Akun anjeun geus siap!

source: Your account password was changed
su: Sandi akun anjeun geus dirobah

source: Your account password was reset with a recovery key
su: Sandi akun anjeun geus disetél ulang ku konci pamulangan

source: Your browsing data will remain on %(deviceName)s, but it will no longer sync with your account.
su: Dada sungsian anjeun bakal nyangkaruk dina %(deviceName)s, ngan moal disingkronkeun kana akun anjeun mah.

source: Your credit card has expired. Please update it <a %(escapedCcExpiredLinkAttrs)s>here</a>.
su: Kartu kiridit anjeun geus kadaluwarsa. Mangga anyarkeun <a %(escapedCcExpiredLinkAttrs)s>di dieu</a>.

source: Your credit card is about to expire
su: Kartu kiridit anjeun tos badé kadaluwarsa

source: You received an email about attempted access to your account. Would you like to report this activity as suspicious?
su: Anjeun geus nampa surélék ngeunaan pamecakan aksés kana akun anjeun. Rék ngalaporkeun atuh ieu aktivitas téh minangka hal nu nyurigakeun?

source: You recently deleted your Firefox Account. As a result, we've cancelled your %(productName)s subscription. Your final payment of %(invoiceTotal)s was paid on %(invoiceDateOnly)s.
su: Anyar-anyar ieu anjeun mupus Akun FIrefox anjeun. Balukarna, pendaptaran %(productName)s dibedokeun. Pembayaran ahir anjeun %(invoiceTotal)s dibayar %(invoiceDateOnly)s.

source: Your email was just returned
su: Surélék anjeun cik kénéh dipulangkeun deui

source: Your email was just returned. Mistyped email?
su: Surélék anjeun cik kénéh dipulangkeun deui. Salah ngetik surélék boa?

source: You're receiving this email because %(email)s has a Firefox account and you signed up for %(productName)s.
su: Anjeun nampa ieu surélék kusabab %(email)s boga akun Firefox sarta anjeun daptar ka %(productName)s.

source: You're signed in and ready to start exploring safely and securely.
su: Anjeun geus asup sarta siap mitembeyan ngalanglang kalawan aman tur salamet.

source: Your Firefox Account is Confirmed
su: Firefox Account anjeun geus Dikonfirmasi

source: Your Firefox Account password
su: Sandi Firefox Account anjeun

source: Your Firefox Account password has been changed
su: Sandi Firefox Account anjeun geus dirobah

source: Your Firefox Account password was successfully changed from the following device:
su: Sandi Firefox Account anjeun geus hasil diganti tina parangkat di handap:

source: Your message was sent to support
su: Surat anjeun geus dikirim ka pangrojong

source: Your message was sent to Support
su: Surat anjeun geus dikirim ka Pangrojong

source: Your new password must be different
su: Sandi anyar anjeun kudu béda

source: Your password has been reset
su: Sandi anjeun geus disetél ulang

source: Your payment is currently processing and may take up to four business days to complete.
su: Pembayaran anjeun keur diolah dibéréskeun nepi ka opat poé gawé.

source: Your subscription will automatically renew each billing period unless you choose to cancel.
su: Langganan anjeun bakal otomatis dianyarkeun unggal periode tagihan iwal anjeun milih bedo.

source: Your sync data is protected
su: Data singkron anjeun kajaga

source: Your synced data can include passwords you've saved.
su: Data singkron anjeun bisa ngawengku kecap konci anu disimpen.

source: Your verification email was just returned. Mistyped email?
su: Surélék vérifikasi anjeun cik kénéh dipulangkeun deui. Salah ngetik surélék boa?

source: You should install Firefox and sync at least two devices to protect against losing your data if you need to restore it but forget your password.
su: Hadéna mah anjeun masang sarta nyingkronkeun sahenteuna di dua parangkat pikeun ngamankeun tina kaleungitan data anjeun saupamana anjeun perlu mulangkeunna deui tapi poho sandi anjeun.

source: You successfully connected your first device to your Firefox Account. Now you can sign in to Sync from your other devices, including Firefox for <a %(androidLinkAttributes)s>Android</a> and <a %(iosLinkAttributes)s>iOS</a>.
su: Anjeun geus hasil nyambungkeun parangkat munggaran anjeun kana Firefox Account anjeun. Ayeuna anjeun bisa asup kana Singkronan ti parangkat anjeun nu séjén, kaasup Firefox jang <a %(androidLinkAttributes)s>Android</a> jeung <a %(iosLinkAttributes)s>iOS</a>.

source: You successfully connected your first device to your Firefox Account. Now you can sign in to Sync from your other devices, including Firefox for <a href='%(androidUrl)s'>Android</a> and <a href='%(iosUrl)s'>iOS</a>.
su: Anjeun geus hasil nyambungkeun parangkat munggaran anjeun kana Firefox Account anjeun. Ayeuna anjeun bisa asup kana Singkronan ti parangkat anjeun nu séjén, kaasup Firefox jang <a href='%(androidUrl)s'>Android</a> jeung <a href='%(iosUrl)s'>iOS</a>.

source: You successfully connected your first device to your Firefox Account. Now you can sign in to Sync from your other devices, including Firefox for Android and iOS.
su: Anjeun geus hasil nyambungkeun parangkat munggaran anjeun kana Firefox Account anjeun. Ayeuna anjeun bisa asup kana Singkronan ti parangkat anjeun nu séjén, kaasup Firefox jang Android jeung iOS.

source: You successfully connected your first device to your Firefox Account. To make the most of Sync, connect any <a href='%(androidUrl)s'>Firefox for Android</a> or <a href='%(iosUrl)s'>Firefox for iOS</a>.
su: Anjeun geus hasil nyambungkeun parangkat munggaran anjeun kana Firefox Account anjeun. Pikeun nyingkronkeunna, sambungkeun <a href='%(androidUrl)s'>Firefox jang Android</a> atawa <a href='%(iosUrl)s'>Firefox jang iOS</a>.

source: You've connected your Firefox account to Mozilla products that keep you secure and productive on the web:
su: Anjeun geus nyambungkeun akun Firefox anjeun ka produk Mozilla anu ngajaga anjeun sangkan aman jeung produktif dina raramat:

source: You've tried too many times. Try again later.
su: Anjeun geus loba teuing mecakan. Pecakan deui engké wé.

source: You've tried too many times. Try again %(retryAfterLocalized)s.
su: Anjeun geus loba teuing mecakan. Pecakan deui %(retryAfterLocalized)s.

source: You will be unable to use your recovery key to access your data in the event you reset your password.
su: Anjeun moal bisa ngagunakeun konci pamulangan pikeun ngaksés data mun anjeun nyetél ulang sandi anjeun.

source: You will need to enter your new password on other devices to resume syncing.
su: Anjeun bakal perlu ngasupkeun sandi anyar anjeun na parangkat séjén pikeun ngahanca singkronan.

source: You will need to generate a new recovery key.
su: Anjeun bakal butuh pangjieunkeun konci pamulangan anyar.

source: You will receive a separate email with download instructions on how to start using %(productName)s.
su: Anjeun bakal nampa surélék misah ngeunaan pituduh ngundeur cara migunakeun %(productName)s.

source: You will receive communications relating to your account security, changes to our policy, your account’s functionality and initial emails to help you get the most from your Firefox Account.
su: Anjeun bakal nampa komunikasi nu patali jeung kaamanan akun anjeun, parobahan kawijakan kami, fungsionalitas akun anjeun sarta surélék awal pikeun mantuan anjeun meunangkeun hasil nu mucekil tina Firefox Account anjeun.

source: 1. Go to Settings
su: 1. Buka Setélan

source: 1 of %d files
su: 1 ti %d koropak

source: %1$@ on %2$@
su: %1$@ dina %2$@

source: 1Password Fill Browser Action
su: Ketak Panyungsi Ngeusi 1Password

source: 1 recovery code remaining
su: Sandi pemulihan kari 1

source: 2. Tap Default Browser App
su: 2. Toél Aplikasi Panyungsi Baku

source: 3. Select Firefox
su: 3. Pilih Firefox

source: Access your open tabs directly on your homescreen.
su: Buka tab anu muka langsung ti layar tepas.

source: Account Verification Required
su: Diperlukeun Akun Vérifikasi

source: Add a Firefox shortcut to your Home screen. After adding the widget, touch and hold to edit it and select a different shortcut.
su: Tambahkeun takulan Firefox ka layar Tepas anjeun. Sanggeus nambahkeun wijet, toél jeung tahan pikeun ngédit sarta milih takulan anu béda.

source: Added page to Reading List
su: Kaca geus ditambahkeun kana Daptar Bacaeun

source: Added Search engine!
su: Tambah Mesin pamaluruh!

source: Added to Reading List
su: Ditambahkeun ka Daptar Bacaeun

source: Added To Reading List
su: Ditambahkeun kana Daptar Bacaeun

source: Add Firefox shortcuts to your Home screen.
su: Tambah takulan Firefox ka layar Tepas anjeun.

source: Address and Search
su: Alamat jeung Paluruh

source: Add Search Engine
su: Tambah Mesin Pamaluruh

source: Add Search Provider?
su: Tambah Panyayaga Pamaluruhan?

source: Add shortcuts to frequently and recently visited sites.
su: Tambahkeun takulan ka loka anu mindeng jeung anyar dibuka.

source: Add shortcuts to your open tabs.
su: Tambah takulan ka tab muka anjeun.

source: Add Tab
su: Tambah Tab

source: Add to Bookmarks
su: Tambahkeun kana Markah

source: Add to Reading List
su: Tambah ka Daptar Bacaeun

source: A device has disconnected from Firefox Sync
su: Parangkat geus dipegarkeun tina Singkronan Firefox

source: Ad trackers
su: Palacak iklan

source: After 10 minutes
su: Sanggeus 10 menit

source: After 15 minutes
su: Sanggeus 15 menit

source: After 1 hour
su: Sanggeus sajam

source: After 1 minute
su: Sanggeus samenit

source: After 5 minutes
su: Sanggeus 5 menit

source: Align QR code within frame to scan
su: Adumaniskeun Kodeu QR kana pigura pikeun mindéy

source: All
su: Kabéh

source: Allow Firefox to use my Photos
su: Heugbaékeun Firefox maké Poto kuring

source: Allows some ad tracking so websites function properly.
su: Idinan sababaraha palacak iklan sangkan raramatloka bisa bener midang.

source: Allows some trackers so websites function properly.
su: Heugbaékeun sawatara palacak sangkan pungsi raramatloka merenah.

source: Always Send
su: Kirim Salawasna

source: A modern mobile browser from Mozilla, the non-profit committed to a free and open web.
su: Panyungsi ider modérn ti Mozilla, tanpabati anu mengkuhkeun kana raramat bébas tur nembrak.

source: Analytic trackers
su: Palacak analisa

source: An error occured while adding the pass to Wallet. Please try again later.
su: Aya kasalahan nalika nambahkeun pass kana Wallet. Pecakan deui engké.

source: Are you sure you want to cancel this download?
su: Yakin anjeun rék ngabolaykeun ieu undeuran?

source: Are you sure you want to delete it and its contents?
su: Nyaan yeuh rek mupus nu ieu jeung sagala eusina?

source: A search engine with this title or URL has already been added.
su: Mesin pamaluruh kalawan ieu judul atawa URL geus ditambahkeun.

source: A username and password are being requested by %@.
su: Sandiasma jeung kecap sandi keur dipénta ku %@.

source: A username and password are being requested by %1$@. The site says: %2$@
su: Sandiasma jeung kecap sandi keur dipénta ku %1$@. Ceuk loka téh: %2$@

source: Authentication required
su: Diperlukeun oténtikasi

source: Automatically
su: Otomatis

source: Automatic Privacy
su: Privasi Otomatis

source: Available Credentials:
su: Krédénsial nu Aya:

source: Available devices:
su: Paranti sayaga:

source: Back to Themes
su: Balik ka Téma

source: Basic (Recommended)
su: Dasar (Pijeujeuh)

source: Be on the Lookout
su: Waspada Permana Tinggal

source: Blank Page
su: Kaca Kosong

source: Block Images
su: Peungpeuk Gambar

source: Block Lists
su: Daptar Peungpeukan

source: Block online trackers
su: Peungpeuk palacak onlén

source: Block Pop-up Windows
su: Peungpeuk Jandéla Pucunghul

source: BLOCKS
su: PEUNGPEUK

source: Blocks known trackers. Some websites may not function properly.
su: Peungpeuk palacak nu kanyahoan. Sawatara raramatloka meureun teu pungsi merenah.

source: Blocks more trackers, ads, and popups. Pages load faster, but some functionality may not work.
su: Peungpeuk palacak, iklan, jeung popup leuwih loba. Kaca muka leuwih gancang, tapi sababaraha pungsionalitas bisa teu jalan.

source: Bookmark Added
su: Markah Ditambahkeun

source: Bookmarked
su: Dimarkahkeun

source: Bookmark Link
su: Cirian Tutumbu

source: Bookmark Removed
su: Markah Dipiceun

source: Bookmarks you save will show up here.
su: Markah anu diteundeun bakal némbongan di dieu.

source: Bookmark This Page
su: Markahkeun Ieu Kaca

source: Brightness
su: Caangan

source: Bring bookmarks, history, and passwords to Firefox on this device.
su: Bawa markah, jujutan, jeung kecap sandi ka Firefox di ieu gawai.

source: Browse like no one’s watching
su: Ngalanglang téh kawas euweuh nu nénjokeun

source: Browse multiple Web pages at the same time with tabs.
su: Langlang bebedan kaca Raramat kalayan babarengan maké tab.

source: Browsing History
su: Jujutan Langlangan

source: Built-in Enhanced Tracking Protection helps stop ads from following you around. Turn on Strict to block even more trackers, ads, and popups.
su: Enhanced Tracking Protection bawaan mantuan ngeureunan iklan nunutur anjeun. Hurungkeun Strict pikeun meungpeuk leuwih loba palacak, iklan, jeung popap.

source: Cache
su: Telih

source: Cancel Download
su: Bolaykeun Ngundeur

source: Cannot Open Page
su: Teu Bisa Muka Kaca

source: Change Passcode
su: Ganti Kodeu rusiah

source: Changes color theme.
su: Robah warna téma

source: Changes font type.
su: Ganti modél fon.

source: Choose
su: Pilih

source: Choose Theme
su: Pilih Téma

source: Choose what to load when opening a new tab
su: Pilih naon nu rék dimuat nalika muka tab anyar

source: Clear All Website Data
su: Hapusan Sakur Data Raramatloka

source: Clearing Recent History will remove history, cookies, and other browser data.
su: Ngahapus Jujutan Anyar bakal miceun jujutan, réméh, jeung data browser lianna.

source: Clear Private Data
su: Beresihan Data Salindungan

source: Clear Private Tabs
su: Beresihan Tab Nyamuni

source: Clear Recent History…
su: Hapus Jujutan...

source: Clear Search
su: Beresihan Pamaluruhan

source: Close All Tabs
su: Tutup Kabéh Tab

source: Close Private Tabs
su: Tutup Tab Nyamuni

source: Close Selected Tab
su: Tutup Tab Pinilih

source: Close Tab
su: Tutup Tab

source: Closing tab
su: Tutup tab

source: computer
su: komputer

source: Connect Another Device
su: Sambungkeun Parangkan Séjén

source: Connect Firefox everywhere you use it.
su: Sambungkeun Firefox dimana waé anjeun ngagunakeunana.

source: Content trackers
su: Palacak kontén

source: Copied Link from clipboard
su: Tironan Tutumbu tina papan klip

source: Copied to clipboard
su: Ditiron kana papan klip

source: Copy Address
su: Tiron Alamat

source: Copy Image
su: Tiron Gambar

source: Copy Image Link
su: Tiron Tutumbu Gambar

source: Copy Link
su: Tiron Tutumbu

source: Copy URL
su: Tiron URL

source: Could not add page to Reading list
su: Teu bisa nambahkeun kaca kana Daptar bacaan

source: Could not add page to Reading List. Maybe it’s already there?
su: Teu bisa nambahkeun kaca kana Daptar Bacaan. Geus aya sugan?

source: Could not load page.
su: Teu bisa muat kaca.

source: Created %@
su: Dijieun %@

source: Create Firefox account.
su: Jieun akun Firefox.

source: Cross-Site Trackers
su: Palacak Meuntas-Loka

source: Cryptominers secretly use your system’s computing power to mine digital money. Cryptomining scripts drain your battery, slow down your computer, and can increase your energy bill.
su: Cryptominer susulumputan maké daya komputer anjeun pikeun ngagali duit digital. Skrip cryptomining matak meres batré, komputer ngeyeted, sarta bisa nambahan tagihan listrik anjeun.

source: Current Homepage
su: Tepas Kiwari

source: Customize Firefox Home
su: Ropéa Tepas Firefox

source: Customize Top Sites
su: Loka Pangluhurna Sakahayang

source: Custom URL
su: URL Sakahayang

source: Dark theme now includes a dark keyboard and dark splash screen.
su: Kiwari téma poék ngawengku kibor poék jeung layar simbeuh poék.

source: Data Management
su: Manajemén Data

source: %d device(s) connected
su: %d parangkat geus nyambung

source: Debug: forget Sync auth state
su: Debug: pohokeun status oténtikasi Singkronan

source: Debug: require password
su: Debug: butuh kecap sandi

source: Debug: require upgrade
su: Debug: butuh apgréd

source: Debug: use stage servers
su: Debug: paké sérver tumahap

source: Decrease text size
su: Badagan ukuran téks

source: Default Browser App
su: Aplikasi Panyungsi Baku

source: Default Search Engine
su: Mesin Pamaluruh Baku

source: Default Themes
su: Téma Baku

source: Delete from History
su: Pupus tina Jujutan

source: Device Name
su: Ngaran Parangkat

source: Disable additional page dialogs
su: Pareuman dialog kaca tatambah

source: Disabled for this site
su: Pareuman pikeun ieu loka

source: Disable for this site
su: Pareuman pikeun ieu loka

source: Disconnect Sync
su: Pegatkeun Singkronan

source: Disconnect Sync?
su: Pegatkeun Singkronan?

source: Discover fascinating and thought-provoking stories from across the web, curated by Pocket.
su: Panggihan carita pingiruteun jeung matak kerung ti rupa-rupa raramat, dikurasi ku Pocket.

source: Display
su: Pidangan

source: Display Settings
su: Setélan Pidangan

source: +%d More…
su: +%d Lianna…

source: Don’t Save
su: Ulah neundeun

source: Don’t Send
su: Ulah Ngirim

source: Don’t Update
su: Ulang Ngapdét

source: Download Cancelled
su: Undeuran Dibolaykeun

source: Downloaded Files
su: Koropak Undeuran

source: Downloaded files will show up here.
su: Koropak undeuran bakal némbongan di dieu.

source: Download Failed
su: Gagal Ngundeur

source: Download Link
su: Undeur Tutumbu

source: Download Now
su: Undeur Ayeuna

source: Downloads aren’t supported in Firefox yet.
su: Undeuran acan dirojong na Firefox.

source: Do you want to save the password for %1$@ on %2$@?
su: Anjeunu hayang neundeun kecap sandi pikeun %1$@ dina %2$@?

source: Do you want to save the password on %@?
su: Anjeun hayang neundeun kecap sandi na %@?

source: Do you want to update the password for %1$@ on %2$@?
su: Anjeunu hayang ngapdét kecap sandi pikeun %1$@ dina %2$@?

source: Do you want to update the password on %@?
su: Anjeunu hayang ngapdét kecap sandi dina %@?

source: Do you want to use this web page as your home page?
su: Anjeun hayang maké ieu kaca raramat minangka tepas anjeun?

source: %d tab(s) closed
su: %d tab ditutup

source: Edit Bookmark
su: Édit Markah

source: Edit Folder
su: Édit Carangka

source: Enabled for this site
su: Hurungkeun pikeun ieu loka

source: Enable for this site
su: Hurungkeun jang ieu loka

source: Enable Night Mode
su: Hurungkeun Modeu Peuting

source: Enable Tracking Protection
su: Hurungkeun Kilung Palacakan

source: Enhanced Tracking Protection blocks malware and stops trackers.
su: Perlindungan Palacakan Lanjutan meungpeuk malwér jeung ngeureunan palacak.

source: Enhanced Tracking Protection is OFF for this site.
su: Perlindungan Palacakan Lanjutan PAREUM pikeun ieu loka.

source: Enhanced Tracking Protection is ON for this site.
su: Perlindungan Palacakan Lanjutan HURUNG pikeun ieu loka.

source: Enter a new passcode
su: Asupkeun kodeu rusiah anyar

source: Enter a passcode
su: Asupkeun kodeu rusiah

source: Enter a webpage
su: Asupkeun kaca raramat

source: Enter passcode
su: Asupkeun kodeu rusiah

source: Enter Passcode
su: Asupkeun Kodeu rusiah

source: Enter Search Mode
su: Asup Modeu Pamaluruhan

source: Enter your password to connect
su: Asupkeun kecap sandi jang nyambungkeun

source: Everything
su: Sagalana

source: Face ID & Passcode
su: Face ID & Kodeu rusiah

source: Failed
su: Gagal

source: Failed to Add Pass
su: Gagal Nambahan Pass

source: Fast, private, and on your side.
su: Gancang, nyamuni, di gigireun anjeun.

source: Fast Search
su: Maluruh Gancang

source: Filter
su: Ayak

source: Filter Sites
su: Saring Loka

source: Find
su: Téangan

source: Find in Page
su: Téangan dina Kaca

source: Firefox blocks cross-site trackers, social trackers, cryptominers, and fingerprinters.
su: Firefox meungpeuk palacak meuntas-loka, palacak sosial, kriptogurandil, jeung sidik ramo.

source: Firefox blocks cross-site trackers, social trackers, cryptominers, fingerprinters, and tracking content.
su: Firefox meungpeuk palacak meuntas-loka, palacak sosial, kriptogurandil, pingerprinter, jeung palacakan kontén.

source: Firefox cannot open the page because it has an invalid address.
su: Firefox teu bisa muka ieu kaca lantaran alamatna henteu sohéh.

source: Firefox Credentials
su: Krédénsial Firefox

source: Firefox Home
su: Tepas Firefox

source: Firefox Home Page
su: Kaca Tepas Firefox

source: Firefox is blocking parts of the page that may track your browsing.
su: Firefox meungpeuk bagéan tina kaca nu sigana lalacak kana langlangan anjeun.

source: Firefox - Open Tabs
su: Firefox - Tab Muka

source: Firefox - Quick Actions
su: Firefox - Lampah Gancang

source: Firefox - Recommended by Pocket
su: Firefox - Disarankeun ku Pocket

source: Firefox requires Face ID to access your saved logins.
su: Firefox butuh Face ID pikeun muka login simpenan anjeun.

source: Firefox Shortcuts
su: Takulan Firefox

source: Firefox Sync
su: Singkronan Firefox

source: Firefox Sync has connected to %@
su: Singkronan Firefox geus nyambung ka %@

source: Firefox - Top Sites
su: Firefox - Loka Punclut

source: Firefox will place things here that you’ve discovered on the web so you can find your way back to the great articles, videos, bookmarks and other pages
su: Firefox bakal merenahkeun di dieu sagala anu kapanggih dina raramat sahingga anjeun bisa nyusud deui artikel, vidéo, markah, jeung kaca hadé lianna

source: Firefox won’t remember any of your history or cookies, but new bookmarks will be saved.
su: Firefox moal nginget jujutan jeung kuki anjeun, anu diteundeun ukur markah anyar.

source: Firefox would like to access your Photos
su: Firefox hayang ngaksés Poto anjeun

source: Folder
su: Carangka

source: Folder Name
su: Ngaran Carangka

source: For iOS 13 users, Firefox now automatically switches to a dark theme when your phone is set to Dark Mode. To change this behavior, go to Settings > Theme.
su: Pikeun nu maké iOS 13, kiwari Firefox otomatis pindah ka téma poék nalika telepon anjeun disetél ka Mode Poék. Pikeun ngarobah ieu paripolah, buka Setélan > Téma.

source: Get the most out of Firefox
su: Maksimalkeun Firefox

source: Get your bookmarks, history and passwords on all your devices.
su: Cokot markah, jujutan, jeung sandi anjeun dina sakur piranti anjeun.

source: Get your open tabs, bookmarks, and passwords from your other devices.
su: Cokot tab anjeun, markah sarta kecap sandina ti akun anjeun nu séjén.

source: Get your tabs, bookmarks, and passwords from your other devices.
su: Cokot tab anjeun, markah sarta kecap sandina ti akun anjeun anu séjén nu keur muka.

source: Go
su: Indit

source: Go to
su: Miang ka

source: Go to copied link
su: Indit ka tutumbu tironan

source: Go to copied link?
su: Indit ka tutumbu meunang niron?

source: Go to Copied Link
su: Indit ka Tutumbu Tironan

source: Go to copied URL?
su: Indit ka URL tironan?

source: Great content from around the web.
su: Kontén hébring ti sakuliah raramat.

source: %@ has been successfully disconnected.
su: %@ geus laksana dipegatkeun.

source: Heads up!
su: Awas!

source: Hide
su: Samunikeun

source: Hide Images
su: Samunikeun Gambar

source: Highlights
su: Cirian

source: History will be removed from all your connected devices. This cannot be undone.
su: Ieu jujutan rék dipiceun ti sakum parangkat anjeun nu nyambung. Ieu peta teu bisa dibedokeun.
